app/controllers/api/greetings_controller.rb

    def index
      greeting = Greeting.all.order('random()').first
---
SELECT "greetings".* FROM "greetings" ORDER BY random() LIMIT $1  [["LIMIT", 1]]